"""random, uniform - получить случайное вещественное число
"""

import random

for i in range(5):
    # случайное вещественное
    # в диапазоне [0.0, 1.0)
    print(random.random())

print('---------')

for i in range(5):
    # случайное вещественное
    # в диапазоне [a, b]
    print(random.uniform(i, i+1))

print('-' * 10)

for i in range(5):
    print(random.uniform(5, 10))
# 0.3857262691293173
# 0.703064816283737
# 0.6327453301517298
# 0.8669371440538192
# 0.6877845691747659
# ---------
# 0.006809242496889745
# 1.1232523587931218
# 2.832723799558661
# 3.3757867189448207
# 4.677401135407305
